1atabey1/esp32tricore-dap/main/main.c
        for (int i = 0; i < sta_list.num; i++) {
            wifi_sta_info_t sta = sta_list.sta[i];
            ESP_LOGI(TAG, "STA %d: MAC=%02X:%02X:%02X:%02X:%02X:%02X, RSSI=%d dBm",
                     i + 1,
                     sta.mac[0], sta.mac[1], sta.mac[2],
                     sta.mac[3], sta.mac[4], sta.mac[5],
                     sta.rssi);
        }
    } else {
        ESP_LOGE(TAG, "Failed to get STA list: %s", esp_err_to_name(ret));
    }
}
esp_err_t set_cfga(bool use_porta, bool use_portb, bool use_portc, bool use_portd, bool njtag_swdio, bool swd_gpio){
    if (!g_board->has_fpga) {
        ESP_LOGI(TAG, "set_cfga skipped on board '%s'", g_board->name);
        return ESP_OK;
    }
    esp_err_t ret1 = 0;
    uint8_t tx[3]={0x0,0,0};
    uint8_t rx[3]={0};
    tx[0] = global_data_reg_1 | 0x80;

    global_data_reg_0 &= ~(CFGPA | CFGPB | CFGPC | CFGPD);

    if(use_porta) {
        global_data_reg_0 |= CFGPA;
    }
    if(use_portb) {
        global_data_reg_0 |= CFGPB;
    }
    if(use_portc) {
        global_data_reg_0 |= CFGPC;
    }
    if(use_portd) {
        global_data_reg_0 |= CFGPD;
    }

    if(njtag_swdio){
        global_data_reg_0 |= NJTAG_SWDIO;
    }
    else{
        global_data_reg_0 &= ~NJTAG_SWDIO;
    }
    if(swd_gpio){
        global_data_reg_0 |= SWD_GPIO;
    }
    else{
        global_data_reg_0 &= ~SWD_GPIO;
    }

    tx[1] = global_data_reg_0;
    ESP_LOGI(TAG, "set_cfga: global_data_reg_0=0x%02x use_porta/b/c/d=%d %d %d %d, jtag_swdio=%d, swd_gpio=%d", 
            global_data_reg_0, use_porta, use_portb, use_portc, use_portd, njtag_swdio, swd_gpio);

    ret1 = spi_device4_transfer_data(tx, rx, 3);
    ESP_LOGI(TAG, "rx=0x%02x %02x %02x",rx[0],rx[1], rx[2]);
    return ret1;
}
esp_err_t set_la_input_sel(bool use_test_signal)
{
    if (!g_board->has_fpga) {
        ESP_LOGI(TAG, "set_la_input_sel skipped on board '%s'", g_board->name);
        return ESP_OK;
    }

    esp_err_t ret1 = 0;
    uint8_t tx[3]={0x0,0,0};
    uint8_t rx[3]={0};
    tx[0] = global_data_reg_1 | 0x80;
    if(use_test_signal) {
        global_data_reg_0 |= LA_INPUT_SEL;//use internal cnt1 as LA input
    }
    else{
        global_data_reg_0 &= ~LA_INPUT_SEL;
    }
    tx[1] = global_data_reg_0;

    ret1 = spi_device4_transfer_data(tx, rx, 3);
    ESP_LOGI(TAG, "rx=0x%02x %02x %02x",rx[0],rx[1], rx[2]);
    return ret1;
}
/* Assert (true) or deassert (false) the SRESET signal on Port B pin3.
 * Port B must be configured as PB_UART_SRESET_VTARGET for the signal
 * to physically appear on the connector. */
esp_err_t set_sreset(bool assert_reset)
{
    if (!g_board->has_fpga) {
        ESP_LOGI(TAG, "set_sreset skipped on board '%s'", g_board->name);
        return ESP_OK;
    }

    esp_err_t ret1 = 0;
    uint8_t tx[3]={0x0,0,0};
    uint8_t rx[3]={0};
    tx[0] = global_data_reg_1 | 0x80;
    /* Convert the logical reset state to the configured electrical level. */
    const bool output_high = gbl_sreset_polarity ? !assert_reset : assert_reset;
    if (output_high) {
        global_data_reg_0 |= SRESET;
    } else {
        global_data_reg_0 &= ~SRESET;
    }
    tx[1] = global_data_reg_0;
    ret1 = spi_device4_transfer_data(tx, rx, 3);
    ESP_LOGI(TAG, "set_sreset(asserted=%d, level=%s): global_data_reg_0=0x%02x",
             assert_reset, output_high ? "HIGH" : "LOW", global_data_reg_0);
    return ret1;
}

bool sreset_is_asserted(void)
{
    const bool output_high = (global_data_reg_0 & SRESET) != 0;
    return gbl_sreset_polarity ? !output_high : output_high;
}

/* Control Port D (P3) signal output via data_reg_1 outsig_sel field.
 * Requires cfgpd=0 (Port D in Logic Analyzer / non-XVC mode).
 *
 * mode:
 *   0 = PORTD_OUT_TRISTATE   — Port D pins tristate (LA input, default)
 *   1 = PORTD_OUT_COUNTER_LO — drive cnt1[3:0]  (132 MHz free-running counter low nibble)
 *   2 = PORTD_OUT_COUNTER_HI — drive cnt1[7:4]  (counter high nibble)
 *   3 = PORTD_OUT_GPIO       — drive data_reg_1[3:0] directly (value = 0..15)
 */
#if CONFIG_AEL_DAP_BRINGUP_AT_BOOT
/*
 * Watch the DAP wires with the board's own logic analyser.
 *
 * Port C is logic-analyser channels 8..11, which is exactly where the DAP
 * signals sit: PC01=ch8 (DAP2), PC02=ch9 (DAP0 clock), PC03=ch10 (DAP1 data),
 * PC04=ch11 (TRST).  The capture block samples the pads, so this works while
 * Port C is muxed to Black Magic Probe rather than to the analyser - which is
 * the whole point, since that is the configuration the probe runs in.
 *
 * The question this answers first: does our clock actually reach the connector?
 * The self-drive check only ever proved the bidirectional pin, and DAP0 and
 * TRST share a register-controlled output enable rather than GPIO 45's.  So the
 * trigger is armed on the clock channel: if the capture never triggers, the
 * clock is not getting out, and no amount of protocol theory matters.
 */
extern uint8_t *psram_buffer;   /* the 128 KB capture landing buffer, in ice.c */

#define DAP_LA_CH_DAP2   8
#define DAP_LA_CH_DAP0   9
#define DAP_LA_CH_DAP1  10
#define DAP_LA_CH_TRST  11

static void dap_la_summarise(const uint16_t *samples, size_t count)
{
    static const char *names[4] = { "DAP2/PC01", "DAP0/PC02", "DAP1/PC03", "TRST/PC04" };

    for (int c = 0; c < 4; c++) {
        const int ch = DAP_LA_CH_DAP2 + c;
        int  edges = 0;
        int  high  = 0;
        int  first_edge = -1;
        int  prev = (samples[0] >> ch) & 1;

        for (size_t i = 0; i < count; i++) {
            const int bit = (samples[i] >> ch) & 1;
            high += bit;
            if (bit != prev) {
                edges++;
                if (first_edge < 0) {
                    first_edge = (int)i;
                }
                prev = bit;
            }
        }
        ESP_LOGI(TAG, "  ch%-2d %-10s edges=%-6d high=%d%%  first edge at sample %d",
                 ch, names[c], edges, (int)((100L * high) / (long)count), first_edge);
    }
}

/* Arm the analyser on the clock channel and hand back once it is waiting. */
static void dap_la_arm(void)
{
    gbl_sample_rate_reg  = 2;         /* 132/3 = 44 MHz, 64 Ki samples ~ 1.49 ms */
    gbl_trigger_enabled  = true;
    gbl_trigger_mode_or  = true;
    gbl_trigger_position = 5;
    for (int i = 0; i < 16; i++) {
        gbl_channel_triggers[i] = TRIGGER_DISABLED;
    }
    gbl_channel_triggers[DAP_LA_CH_DAP0] = TRIGGER_RISING;
    start_capture(false);
}

/* Wait for the capture to complete, read it back and summarise it. */
static bool dap_la_collect(const char *what)
{
    for (int attempt = 0; attempt < 20 && !gbl_triggered_flag; attempt++) {
        read_capture_status();
        if (!gbl_triggered_flag) {
            vTaskDelay(pdMS_TO_TICKS(10));
        }
    }
    if (!gbl_triggered_flag) {
        ESP_LOGE(TAG, "  %s: no trigger - the clock never reached PC02", what);
        return false;
    }

    read_and_return_capture();
    const uint16_t *samples = (const uint16_t *)(psram_buffer + 4);
    const size_t    count   = (ICE_CAPTURE_BUFFER_SIZE - 4) / sizeof(uint16_t);

    ESP_LOGI(TAG, "  %s:", what);
    dap_la_summarise(samples, count);
    return true;
}

