1atabey1/esp32tricore-dap/main/main.c
/*
 * Which level of the direction pin lets our data out?
 *
 * Drives an alternating pattern on DAP1 with the direction pin held at each
 * level in turn, and watches the connector.  Exactly one of the two should show
 * the pattern on ch10; whichever it is settles the polarity, and if neither
 * does then the FPGA is not passing our data at all in this port mode.
 */
static void dap_la_direction_polarity(void)
{
    for (int dir = 0; dir <= 1; dir++) {
        dap_la_arm();
        dap_phy_force_dir(dir);
        dap_phy_training_pattern(32);   /* 128 clocks, DAP1 alternating */
        char label[48];
        snprintf(label, sizeof(label), "dir=%d, 128 clocks of alternating DAP1", dir);
        dap_la_collect(label);
    }
}

/*
 * Is anything actually attached to the data line?
 *
 * Hold DAP1 low with the probe driving, then release it and watch how fast the
 * pad comes back up.  The rise is an RC against whatever pull-up is on the net:
 *
 *   only the ICE40's own input pull-up (~100 k) into pad plus a little cable
 *   capacitance takes microseconds - hundreds of samples at 44 MHz;
 *   a target pin with its own pull-up of a few tens of k is several times
 *   faster; a target holding the line down means it never rises at all.
 *
 * This distinguishes a bare floating pad from a connected target pin, which is
 * the one thing the edge counts cannot tell apart.
 */
static void dap_la_release_time(void)
{
    ESP_LOGI(TAG, "  release test: hold DAP1 low, let go, time the rise");

    for (int start_level = 0; start_level <= 1; start_level++) {
        dap_phy_force_dir(0);
        dap_phy_drive_data(start_level);
        vTaskDelay(pdMS_TO_TICKS(5));

        gbl_sample_rate_reg  = 2;
        gbl_trigger_enabled  = true;
        gbl_trigger_mode_or  = true;
        gbl_trigger_position = 5;
        for (int i = 0; i < 16; i++) {
            gbl_channel_triggers[i] = TRIGGER_DISABLED;
        }
        gbl_channel_triggers[DAP_LA_CH_DAP0] = TRIGGER_RISING;
        start_capture(false);

        dap_phy_idle_clocks(1, start_level);   /* marker, data still held */
        dap_phy_turnaround_to_read();          /* release */

        char label[72];
        snprintf(label, sizeof(label),
                 "released from %s: does the net move on its own?",
                 start_level ? "high" : "low");
        dap_la_collect(label);
    }
}

static void dap_la_capture_test(void)
{
    if (!g_board->has_logic_analyzer) {
        return;
    }

    ESP_LOGI(TAG, "=== DAP wire capture: arming on the clock channel ===");

    /*
     * This runs before start_background_tasks(), so logic_analyzer_init() has
     * not allocated the landing buffer yet.  Allocating it here is safe and
     * idempotent: the allocation in ice.c is guarded on psram_buffer == NULL.
     */
    if (psram_buffer == NULL) {
        psram_buffer = heap_caps_malloc(ICE_CAPTURE_BUFFER_SIZE, MALLOC_CAP_SPIRAM);
        if (psram_buffer == NULL) {
            ESP_LOGE(TAG, "  no PSRAM for the capture buffer");
            return;
        }
    }

    if (dap_probe_init(CONFIG_AEL_DAP_BRINGUP_CLOCK_HZ) != ESP_OK) {
        ESP_LOGE(TAG, "  PHY init failed, nothing to capture");
        return;
    }
    dap_la_arm();                     /* armed, waiting for the clock's first edge */
    dap_exchange_t x;
    dap_probe_sync(&x);               /* the traffic we want to see on the wire */
    dap_la_collect("sync frame plus reply window");

    /* Then settle what the sync capture only hints at. */
    dap_la_direction_polarity();
    dap_la_release_time();
}
#endif /* CONFIG_AEL_DAP_BRINGUP_AT_BOOT */

esp_err_t set_portd_output(uint8_t mode, uint8_t value)
{
    if (!g_board->has_fpga) {
        ESP_LOGI(TAG, "set_portd_output skipped on board '%s'", g_board->name);
        return ESP_OK;
    }

    esp_err_t ret;
    uint8_t tx[3] = {0, 0, 0};
    uint8_t rx[3] = {0};

    /* outsig_sel → bits [5:4]; gpio_output_data → bits [3:0]; bit [6] untouched */
    global_data_reg_1 &= ~0x3F;                    /* clear bits [5:0] */
    global_data_reg_1 |= (mode & 0x3) << 4;        /* set outsig_sel */
    if (mode == 3) {
        global_data_reg_1 |= (value & 0xF);        /* set gpio_output_data */
    }

    tx[0] = global_data_reg_1 | 0x80;              /* write flag */
    tx[1] = global_data_reg_0;
    ret = spi_device4_transfer_data(tx, rx, 3);
    ESP_LOGI(TAG, "set_portd_output: mode=%d val=%d data_reg_1=0x%02x", mode, value, global_data_reg_1);
    return ret;
}

/* ── Port D frequency toggle ──────────────────────────────────────────────
 * Drives Port D (P3) pins 0-3 as a square wave (0x00 ↔ 0x0F) using
 * esp_timer.  freq_hz=0 stops the timer and tristates Port D.
 * Valid non-zero values: 125, 250, 500, 1000 Hz.
 */
static esp_timer_handle_t s_portd_toggle_timer = NULL;
static volatile uint8_t   s_portd_toggle_state = 0;

static void portd_toggle_cb(void *arg)
{
    s_portd_toggle_state ^= 1;
    set_portd_output(PORTD_OUT_GPIO, s_portd_toggle_state ? 0x0F : 0x00);
}

esp_err_t set_portd_freq(uint32_t freq_hz)
{
    if (!g_board->has_fpga) {
        ESP_LOGI(TAG, "set_portd_freq skipped on board '%s'", g_board->name);
        return ESP_OK;
    }

    if (s_portd_toggle_timer) {
        esp_timer_stop(s_portd_toggle_timer);
        esp_timer_delete(s_portd_toggle_timer);
        s_portd_toggle_timer = NULL;
    }
    if (freq_hz == 0) {
        return set_portd_output(PORTD_OUT_TRISTATE, 0);
    }
    uint64_t half_us = 1000000ULL / (2ULL * freq_hz);
    esp_timer_create_args_t args = {
        .callback        = portd_toggle_cb,
        .arg             = NULL,
        .dispatch_method = ESP_TIMER_TASK,
        .name            = "portd_tog",
    };
    esp_err_t ret = esp_timer_create(&args, &s_portd_toggle_timer);
    if (ret != ESP_OK) return ret;
    s_portd_toggle_state = 0;
    return esp_timer_start_periodic(s_portd_toggle_timer, half_us);
}

bool gbl_sw2_gpio48_flag = false;
void check_sw1_sw2(void)
{
    static uint8_t L0 = 0, L48 = 0;    /* Previous GPIO levels, persist across calls */

    // Read the level of GPIO0
    int level_0 = ael_board_has_valid_gpio(PIN_PUSHBUTTON_BOOT_SW1) ? gpio_get_level(PIN_PUSHBUTTON_BOOT_SW1) : 0;

