1atabey1/esp32tricore-dap/main/main.c
    // Read the level of GPIO48
    int level_48 = ael_board_has_valid_gpio(PIN_PUSHBUTTON_SW2) ? gpio_get_level(PIN_PUSHBUTTON_SW2) : 0;

    if(L0 != level_0 || L48 != level_48){
        if(g_board->has_secondary_button && L48 != level_48 && level_48 == 1){
            gbl_sw2_gpio48_flag = !gbl_sw2_gpio48_flag;
        }
        ESP_LOGI(TAG, "GPIO%d Level: %d | GPIO%d Level: %d gbl_sw2_gpio48_flag=%s",
                PIN_PUSHBUTTON_BOOT_SW1, level_0,
                PIN_PUSHBUTTON_SW2, level_48,
                gbl_sw2_gpio48_flag ? "True":"False");
        L0 = level_0;
        L48 = level_48;
    }
}

/* Draw initial WiFi mode/SSID info on LCD before network is up. */
static void draw_wifi_startup_info(void)
{
    if (g_app_params.mode == APP_MODE_AP) {
        char ap_ip_buf[16] = {0};
        get_ap_ip_str(ap_ip_buf, sizeof(ap_ip_buf));
        Paint_DrawString_EN(X_OFFSET, 10, "AP Mode", &CURR_FONT, BLACK, BLUE);
        Paint_DrawString_EN(X_OFFSET, 10 + 24 * 2, "SSID:", &CURR_FONT, BLACK, YELLOW);
        Paint_DrawString_EN(X_OFFSET + 17 * 5, 10 + 24 * 2, g_app_params.wifi_ssid, &CURR_FONT, BLACK, MAGENTA);
        Paint_DrawString_EN(X_OFFSET, 10 + 24 * 3, "PSWD:", &CURR_FONT, BLACK, YELLOW);
        Paint_DrawString_EN(X_OFFSET + 17 * 5, 10 + 24 * 3, g_app_params.wifi_pass, &CURR_FONT, BLACK, MAGENTA);
    } else {
        Paint_DrawString_EN(X_OFFSET, 10, "ST Mode", &CURR_FONT, BLACK, BLUE);
        Paint_DrawString_EN(X_OFFSET, 10 + 24 * 2, "SSID:", &CURR_FONT, BLACK, YELLOW);
        Paint_DrawString_EN(X_OFFSET + 17 * 5, 10 + 24 * 2, g_app_params.wifi_ssid, &CURR_FONT, BLACK, MAGENTA);
    }
    // Port row: "PORT XVC:2542 GDB:4242"
    Paint_DrawString_EN(X_OFFSET, 10+24*4, "PORT ", &CURR_FONT, BLACK, YELLOW);
    Paint_DrawString_EN(X_OFFSET + 5*PAINT_CHAR_WIDTH,  10+24*4, "XVC:", &CURR_FONT, BLACK, BLUE);
    Paint_DrawString_EN(X_OFFSET + 9*PAINT_CHAR_WIDTH,  10+24*4, "2542", &CURR_FONT, BLACK, MAGENTA);
    Paint_DrawString_EN(X_OFFSET + 13*PAINT_CHAR_WIDTH, 10+24*4, "GDB:", &CURR_FONT, BLACK, BLUE);
    Paint_DrawString_EN(X_OFFSET + 17*PAINT_CHAR_WIDTH, 10+24*4, "4242", &CURR_FONT, BLACK, MAGENTA);
}

/* Draw PA/PB/PC/PD port configuration on LCD. */
static void draw_port_cfg_info(void)
{
    uint32_t y = 10 + 24*5;
    Paint_DrawString_EN(X_OFFSET, y, "PA:          PB:", &CURR_FONT, BLACK, YELLOW);
    Paint_DrawString_EN(X_OFFSET + 3*PAINT_CHAR_WIDTH, y, "LA", &CURR_FONT, BLACK, MAGENTA);
    Paint_DrawString_EN(X_OFFSET + 16*PAINT_CHAR_WIDTH, y,
        (gbl_pb_cfg == PB_UART_SRESET_VTARGET) ? "UART" : "LA", &CURR_FONT, BLACK, MAGENTA);

    y += 15;
    Paint_DrawString_EN(X_OFFSET, y, "PC:          PD:", &CURR_FONT, BLACK, YELLOW);
    Paint_DrawString_EN(X_OFFSET + 3*PAINT_CHAR_WIDTH, y,
        (gbl_pc_cfg == PC_BMP_SWD_JTAG) ? "SWD/JTAG" : "LA", &CURR_FONT, BLACK, MAGENTA);
    Paint_DrawString_EN(X_OFFSET + 16*PAINT_CHAR_WIDTH, y,
        (gbl_pd_cfg == PD_FPGA_XVC) ? "XVC" : "LA", &CURR_FONT, BLACK, MAGENTA);
}

/* Start background tasks (GDB, logic analyser, XVC). */
static void start_background_tasks(void)
{
    if (gbl_pc_cfg == PC_BMP_SWD_JTAG) {
        ESP_LOGI(TAG, "Creating gdb_thread task. gbl_pa_cfg=%d, gbl_pc_cfg=%d", gbl_pa_cfg, gbl_pc_cfg);
        ESP_LOGI(TAG, "Free heap: %u", esp_get_free_heap_size());
        ESP_LOGI(TAG, "To do platform_init() for BMP");
        platform_init();
        ESP_LOGI(TAG, "To do xTaskCreate(&gdb_application_thread) for BMP");
        BaseType_t result = xTaskCreate(&gdb_application_thread, "gdb_thread", 4096, NULL, 15, NULL);
        if (result != pdPASS) {
            ESP_LOGE(TAG, "Failed to create gdb_thread task! Out of memory?");
        }
    }

    if (g_board->has_logic_analyzer) {
        logic_analyzer_init();
    }

    if (g_board->has_xvc && gbl_pd_cfg == PD_FPGA_XVC) {
        ESP_LOGI(TAG, "To do xTaskCreate(xvc_server_task)");
        xTaskCreate(xvc_server_task, "xvc_server_task", 4096, NULL, 5, NULL);
    }
}

void app_main(void) {

    global_data_reg_0 = 0;
    global_data_reg_1 = 0; // set PC and PD as input
    g_board = ael_board_profile_get();

    esp_log_level_set(TAG, ESP_LOG_INFO);
    ESP_LOGI(TAG, "Board profile: %s", g_board->name);
    init_idf_components();

    gbl_spi_rxbuf = heap_caps_malloc(2048, MALLOC_CAP_DMA);
    assert(gbl_spi_rxbuf);

    capture_start_semaphore = xSemaphoreCreateBinary();
    capture_done_semaphore = xSemaphoreCreateBinary();

#if ESP32JTAG_BOARD
    // esp32jtag v1.3/v1.4 pwm to Vout mapping (approx):
    // 0-->3.36V, 6-->3.32V, 8-->3.30V, 12-->3.27V, 18-->3.23V, 22-->3.20V, 32-->3.13V, 40-->3.03V,
    // 100-->2.65V, 120-->2.52V, 123-->2.50V, 200-->1.99V, 220-->1.85V, 228-->1.80V, 235-->1.75V,
    // 250-->1.66V, 271-->1.50V, 275-->1.48V, 300-->1.33V, 318-->1.20V, 320-->1.19V,
    // 322-->1.18V, 350-->1.00V, 400-->0.66V
    uint16_t pwm1_duty = INITIAL_VIO_DUTY;  /* default: 3.3V when key absent */
    {
        char *volt_str = NULL;
        if (storage_alloc_and_read(TARGET_VOLTAGE_KEY, &volt_str) == ESP_OK && volt_str) {
            int idx = atoi(volt_str);
            free(volt_str);
            if (idx >= 0 && idx < (int)VIO_DUTY_TABLE_SIZE) {
                pwm1_duty = vio_duty_table[idx];
            }
        }
        /* If key absent (fresh flash or after factory reset): pwm1_duty stays INITIAL_VIO_DUTY = 3.3V */
    }
    ESP_LOGI(TAG, "VIO voltage: pwm1_duty=%u", pwm1_duty);
    setup_pwm1();
    set_pwm1_duty(pwm1_duty);
#endif
    AD_CH1_init();

    load_network_params();
    load_port_configurations();

    //LCD related starts here ****
    if (g_board->has_lcd) {
        lcd_init();
        lcd_clear(); //clear screen
        Paint_NewImage(LCD_WIDTH, LCD_HEIGHT, 0, BLACK);
    }

    if (g_board->has_fpga) {
        ICE_Init();
        load_fpga();
    }

    if (g_board->has_lcd) {
        draw_wifi_startup_info();
    }

    if (g_app_params.mode == APP_MODE_AP) {
    } else {
        ESP_LOGI(TAG, "Waiting for the network connection...");
    }

    httpd_handle_t http_handle;
    if (web_server_start(&http_handle) != ESP_OK) {
        ESP_LOGE(TAG, "Web server couldn't be started!");
        goto _wait;
    }

