1atabey1/esp32tricore-dap/main/main.c
    struct network_init_config config = {
        .adapter_name = g_app_params.net_adapter_name,
        .ssid = g_app_params.wifi_ssid,
        .pass = g_app_params.wifi_pass,
        .http_handle = &http_handle
    };

    if (network_start(&config) != ESP_OK) {
         // Fallback logic
        ESP_LOGI(TAG, "Network connection can not be establised. Please check your wifi credentials!");

        // Fallback to AP mode
        if (g_app_params.mode == APP_MODE_STA) {
            ESP_LOGW(TAG, "STA connection failed. Switching to AP Mode fallback.");

            // Save AP mode settings to NVS
            storage_handle_t h;
            if (storage_open_session(&h) == ESP_OK) {
                storage_write_session(h, WIFI_MODE_KEY, "AP", 2);
                storage_close_session(h);
            }
        } else {
            ESP_LOGW(TAG, "Network connection failed!");
        }
        ESP_LOGW(TAG, "Restarting in 3 seconds...");
        vTaskDelay(3000 / portTICK_PERIOD_MS);
        esp_restart();
    }

    //Go on for successful connection
    if (!strcmp(config.adapter_name, "wifiprov")) {
        network_get_sta_credentials(g_app_params.wifi_ssid, g_app_params.wifi_pass);
        storage_write(WIFI_SSID_KEY, g_app_params.wifi_ssid, strlen(g_app_params.wifi_ssid));
        storage_write(WIFI_PASS_KEY, g_app_params.wifi_pass, strlen(g_app_params.wifi_pass));

        ESP_LOGI(TAG, "Wifi credentials have been changed. Restarting in 2 seconds...");
        vTaskDelay(2000 / portTICK_PERIOD_MS);
        esp_restart();
    }

    network_get_my_ip(g_app_params.my_ip);

    // **** IP address display for STA mode goes here ****
    if (g_board->has_lcd) {
        if (g_app_params.mode == APP_MODE_STA) {
            Paint_DrawString_EN(X_OFFSET, 10 + 24, "IP:", &CURR_FONT, BLACK, YELLOW);
            Paint_DrawString_EN(X_OFFSET + 17 * 5, 10 + 24, g_app_params.my_ip, &CURR_FONT, BLACK, MAGENTA);
        } else if (g_app_params.mode == APP_MODE_AP) {
            char ap_ip_buf[16] = {0};
            get_ap_ip_str(ap_ip_buf, sizeof(ap_ip_buf));
            Paint_DrawString_EN(X_OFFSET, 10 + 24, "IP:", &CURR_FONT, BLACK, YELLOW);
            Paint_DrawString_EN(X_OFFSET + 17 * 5, 10 + 24, ap_ip_buf, &CURR_FONT, BLACK, MAGENTA);
        }
    }

    esp_err_t ret_spi = ESP_OK;
    if(gbl_spi_h1 == NULL){
        ret_spi = spi_master_init();
        if (ret_spi != ESP_OK) {
            ESP_LOGE(TAG, "SPI init failed: %s", esp_err_to_name(ret_spi));
        }
    }

    // SPI mode for SWD/JTAG is currently disabled — always use GPIO bitbang.
    // SPI mode has known issues and is not ready for use.
    // In the future, this can be re-enabled: the mode will be configurable via
    // the web interface and persisted in NVS under MCU_INTERFACE_KEY ("SPI"/"GPIO").
    // When that time comes, restore the NVS read block below and remove this forced assignment.
    SPI_nGPIO = false;

    //set PA and PC for swd_jtag. They are mutual excluded: Either use PA or PC for swd_jtag.
    bool b_use_porta = false; //gbl_pa_cfg == PA_BMP_SWD_JTAG;
    bool b_use_portb = gbl_pb_cfg != PB_LOGICANALYZER;
    bool b_use_portc = (gbl_pc_cfg == PC_BMP_SWD_JTAG);
    bool b_use_portd = gbl_pd_cfg != PD_LOGICANALYZER;
    ESP_LOGI(TAG, "To set_cfga(), Using %s for SWD/JTAG, b_use_porta=%d, b_use_portc=%d", SPI_nGPIO ? "SPI" : "GPIO", b_use_porta, b_use_portc);
    /* Establish the safe inactive level while Port B is still disconnected,
     * then enable its output. set_cfga() preserves the SRESET bit. */
    set_sreset(false);
    //esp32jtag_common.h:esp_err_t set_cfga(bool use_portc, bool use_porta, bool njtag_swdio, bool swd_gpio);
    set_cfga(b_use_porta, b_use_portb, b_use_portc, b_use_portd, true, !SPI_nGPIO); // use_portc, not use_porta, swdio, SPI not gpio

    set_la_input_sel(false);

#if CONFIG_AEL_DAP_BRINGUP_AT_BOOT
    dap_la_capture_test();

    /*
     * Sweep the ADC channels the schematic wires to the port pins through 100 K
     * dividers (R108: PA01, PB01; R109: PC01, PD01).  With a target attached
     * this is a four-point voltmeter on the connector, which is the cheapest
     * way to tell an unpowered target from a protocol problem.  Raw counts are
     * logged rather than scaled volts: the divider ratio is only known for the
     * one channel the firmware already scales.
     */
    for (int ch = ADC_CHANNEL_0; ch <= ADC_CHANNEL_4; ch++) {
        adc_oneshot_chan_cfg_t cfg = {
            .atten = ADC_ATTEN_DB_12,
            .bitwidth = ADC_BITWIDTH_DEFAULT,
        };
        if (adc_oneshot_config_channel(gbl_adc_handle, ch, &cfg) != ESP_OK) {
            continue;
        }
        int raw = 0;
        if (adc_oneshot_read(gbl_adc_handle, ch, &raw) == ESP_OK) {
            ESP_LOGI(TAG, "port ADC ch%d raw=%d", ch, raw);
        }
    }

    /* Port C is now routed to the S3's GPIO, which is what the DAP probe needs.
     * Run before start_background_tasks() so BMP's gdb thread is not also
     * holding these pins. */
    if (b_use_portc) {
        if (dap_probe_init(CONFIG_AEL_DAP_BRINGUP_CLOCK_HZ) == ESP_OK) {
            dap_probe_bringup_report();
        }
    } else {
        ESP_LOGW(TAG, "DAP bring-up skipped: Port C is not in SWD/JTAG mode");
    }
#endif

    start_background_tasks();
    if (g_board->has_lcd) {
        draw_port_cfg_info();
    }
    init_gpio_sw1_sw2();

_wait:

    char *disable_dap_val = NULL;
    bool disable_usb_dap = true;  /* default: disabled */
    if (storage_alloc_and_read(DISABLE_USB_DAP_KEY, &disable_dap_val) == ESP_OK && disable_dap_val) {
        disable_usb_dap = (strcmp(disable_dap_val, "1") == 0);
        free(disable_dap_val);
    }

    if (!disable_usb_dap) {
        xTaskCreate(cherry_dap_task, "cherry_dap_task", 4096, NULL, 5, NULL);
    } else {
        ESP_LOGI(TAG, "USB based CMSIS-DAP and COM port is disabled");
    }

    ESP_LOGI(TAG, "[APP] Free memory: %lu bytes", esp_get_free_heap_size());
    while (true) {
        ESP_LOGI(TAG, "Free internal and DMA memory: %d %d",
                heap_caps_get_free_size(MALLOC_CAP_INTERNAL),
                heap_caps_get_free_size(MALLOC_CAP_DMA));

        if (g_app_params.mode == APP_MODE_AP && g_board->has_lcd) {
            print_sta_info();
        }

        vTaskDelay(3000 / portTICK_PERIOD_MS);
    }

    esp_restart();
}
